congcong1991/DAHUA/lwip_client_socket_public_master/ESP32_uart/bsp_esp32_UART.c
#include "bsp_Esp32_UART.h"
#include <stdio.h> 
#include <FreeRTOS.h> 
#include <fsl_lpuart.h> 
#include <task.h>
#include <string.h>  
#include <stdbool.h>
#include <stdarg.h>
#include <app.h>
#include <fsl_lptmr.h>

#define DMA_LPUART LPUART1
#define DEMO_LPUART_CLKSRC kCLOCK_Osc0ErClk
#define DEMO_LPUART_CLK_FREQ CLOCK_GetFreq(kCLOCK_Osc0ErClk)
#define LPUART_TX_DMA_CHANNEL 1U
#define LPUART_RX_DMA_CHANNEL 2U
#define EXAMPLE_LPUART_DMAMUX_BASEADDR DMAMUX0
#define LPUART_DMA_BASEADDR DMA0
#define LPUART_TX_DMA_REQUEST kDmaRequestMux0LPUART1Tx
#define LPUART_RX_DMA_REQUEST kDmaRequestMux0LPUART1Rx
#define ECHO_BUFFER_LENGTH 8


uint8_t 	 	 TxdBuf[TX_BUFFER_SIZE];
uint8_t        RxdBuf[RX_BUFFER_SIZE];
uint8_t    RxdTelBuf[RX_BUFFER_SIZE];
uint8_t    ErrorBuf[RX_BUFFER_SIZE];
uint16_t ErrorBufBytes=0;
volatile uint16_t RxdBufHeadIndex=0;
volatile uint16_t RxdBufTailIndex=0;

uint16_t TxdBytes=0;
volatile uint16_t RxdBytes=0;
uint16_t TxdTelBytes=0;
volatile uint16_t RxdTelBytes=0;
volatile uint8_t ReceivedTel=0;

uint8_t    ATcmd[RX_BUFFER_SIZE];
uint16_t ATcmdLength;
struct  STRUCT_USARTx_Fram strEsp32_Fram_Record = { 0 };

lpuart_edma_handle_t wifi_lpuartEdmaHandle;
edma_handle_t wifi_lpuartTxEdmaHandle;
lpuart_transfer_t xfer;
lpuart_transfer_t sendXfer;
lpuart_transfer_t receiveXfer;
/**
  * @brief  Esp32初始化函数
  * @param  无
  * @retval 无
  */
void Esp32_Init ( void )
{ 
	macEsp32_RST_LOW_LEVEL();
	DelayMS(100);
	macEsp32_RST_HIGH_LEVEL();
 // DelayMS(350);
//	macEsp32_CH_DISABLE();	
	
}

uint8_t hasByteToTxd()		 // =1 ?????
{
	if(TailIndex==HeadIndex) {
		TxdTelBytes=0;
  	TxdBytes=0;
	  return(0);
	}
	{
		TxdTelBytes=TXDBUFLength[TailIndex];
	  return 1;
	}
			
}
uint8_t  getTxdByte()   //
{ 
	uint8_t re;
	#ifdef USE_LPUART1_TransmissionCompleteInterrupt	
	if(TxdBytes <TxdTelBytes)
	{
		re=TXDBUF[TailIndex][TxdBytes];
		TxdBytes++;
		if(TxdBytes ==TxdTelBytes)
		{ TxdBytes=0;
			Increase(TailIndex);  //increase
		}
		
	}
	return(re);
	#endif
	
	#ifdef USE_LPUART1_DMA_TransmissionInterrupt
	re=TXDBUF[TailIndex][0];
	return(re);
	#endif	
}

/*
 * 函数名：itoa
 * 描述  ：将整形数据转换成字符串
 * 输入  ：-radix =10 表示10进制，其他结果为0
 *         -value 要转换的整形数
 *         -buf 转换后的字符串
 *         -radix = 10
 * 输出  ：无
 * 返回  ：无
 * 调用  ：被USART2_printf()调用
 */
static char * itoa( int value, char *string, int radix )
{
	int     i, d;
	int     flag = 0;
	char    *ptr = string;

	/* This implementation only works for decimal numbers. */
	if (radix != 10)
	{
		*ptr = 0;
		return string;
	}

	if (!value)
	{
		*ptr++ = 0x30;
		*ptr = 0;
		return string;
	}

	/* if this is a negative value insert the minus sign. */
	if (value < 0)
	{
		*ptr++ = '-';

		/* Make the value positive. */
		value *= -1;
		
	}

	for (i = 10000; i > 0; i /= 10)
	{
		d = value / i;

		if (d || flag)
		{
			*ptr++ = (char)(d + 0x30);
			value -= (d * i);
			flag = 1;
		}
	}

	/* Null terminate the string. */
	*ptr = 0;

	return string;

} /* NCL_Itoa */



void Enable485TXD(void)
{ 
	#ifdef USE_LPUART1_TransmissionCompleteInterrupt
	LPUART_EnableInterrupts(LPUART1,kLPUART_TransmissionCompleteInterruptEnable);
  #endif
	#ifdef USE_LPUART1_DMA_TransmissionInterrupt

	DMA0->SERQ = DMA_SERQ_SERQ(1);

	#endif

}

void Disable485TXD(void)
{ 
	#ifdef USE_LPUART1_TransmissionCompleteInterrupt

  LPUART_DisableInterrupts(LPUART1,kLPUART_TransmissionCompleteInterruptEnable);
	
	#endif
	
	#ifdef USE_LPUART1_DMA_TransmissionInterrupt
  

	DMA0->CERQ =DMA_CERQ_CERQ(1);
	
	#endif
}
void startTxd(LPUART_Type * USARTx)
{ 
	Enable485TXD(); 
}

void USART_DATA_Esp32( LPUART_Type * USARTx, uint8_t * Data, uint16_t length )
{ 
	for(uint32_t i=0;i<length;i++)
	TxdBuf[i]=* Data++;
	
	TxdBytes=0;
	TxdTelBytes=length;
	
	startTxd(USARTx);			   // ?????? ,????
	
}


 uint8_t WriteDataToTXDBUF(uint8_t * source,uint16_t length)
{ 
	
	if(xSemaphoreTake(WRITE_ready, portMAX_DELAY) != pdTRUE);//  等信号量，没毛病
	__disable_irq();	   //不应该屏蔽所有中断，先用着
	if(isTxdBufFull()) 
	{
	xSemaphoreGive(WRITE_ready);//释放信号量这块
	__enable_irq();

	return 0;
	} //队列满了就不完
	__enable_irq();
#ifdef Auto_CuttingPackage
	TXDBUFLength[HeadIndex]=length+4;
#else
	TXDBUFLength[HeadIndex]=length;
#endif
	for(uint16_t i=0;i<length;i++)
	TXDBUF[HeadIndex][i]=source[i];
#ifdef Auto_CuttingPackage
  TXDBUF[HeadIndex][length]=0xff;
  TXDBUF[HeadIndex][length+1]=0xff;
	TXDBUF[HeadIndex][length+2]=0xff;
	TXDBUF[HeadIndex][length+3]=0xff;
#endif

#ifdef USE_LPUART1_TransmissionCompleteInterrupt
  Increase(HeadIndex);
	Enable485TXD();
	#endif
	
#ifdef USE_LPUART1_DMA_TransmissionInterrupt
	  __disable_irq();	   //不应该屏蔽所有中断，先用着
	 if(HeadIndex==TailIndex)
	 { 
    //__enable_irq();
	  DMA0->TCD[1].SADDR = (uint32_t)&TXDBUF[TailIndex][0];
		DMA0->TCD[1].CITER_ELINKNO = TXDBUFLength[TailIndex];
		DMA0->TCD[1].BITER_ELINKNO = TXDBUFLength[TailIndex];	
		DMA0->TCD[1].SLAST =0-TXDBUFLength[TailIndex];//这句本质上可以不要，我反正重置源地址了 
		//**** Destination address reload after major loop finish, no address reload needed
		DMA0->TCD[1].DLAST_SGA = 0x00;

		//__disable_irq();	   //不应该屏蔽所有中断，先用着
	  Increase(HeadIndex);
	  __enable_irq();
		DMA0->SERQ = DMA_SERQ_SERQ(1);
		
	 }else
	 {
   // __disable_irq();	   //不应该屏蔽所有中断，先用着
	  Increase(HeadIndex);
	  __enable_irq();
	 }
	#endif
	
	
	xSemaphoreGive(WRITE_ready);//释放信号量这块
	return 1;
}

void USART_CMD_Esp32( LPUART_Type * USARTx, char * Data, ... )
{ const char *s;
	int d;   
  char buf[126];  //限制了发送字节的长度，66个
	va_list ap;
	va_start(ap, Data);
	uint16_t 	j=0;
	while ( * Data != 0 )     // 判断是否到达字符串结束符
	{				                          

			if ( * Data == '%')
		{									  //
			switch ( *++Data )
			{				
				case 's':										  //字符串
				s = va_arg(ap, const char *);
				
				for ( ; *s; s++) 
				{
					ATcmd[j++]=*s;	
					
				}
				
				Data++;
				break;

				case 'd':			
					//十进制
				d = va_arg(ap, int);
				
				itoa(d, buf, 10);
				
				for (s = buf; *s; s++) 
				{
					ATcmd[j++]=*s;
				}
				
				Data++;
				break;
				
				default:
				Data++;
				j++;
				break;
				
			}		 
		}
		
