congcong1991/DAHUA/lwip_client_socket_public_master/ESP32_uart/bsp_esp32_UART.c
		else {ATcmd[j++]=*Data++;
		}
		
			
		
	}
	
	//TxdBytes=0;
	ATcmdLength=j;
	WriteDataToTXDBUF(ATcmd,ATcmdLength);
//	startTxd(USARTx);			   // ?????? ,????

}


/**
  * @brief  初始化Esp32用到的GPIO引脚
  * @param  无
  * @retval 无
  */


/**
  * @brief  配置 Esp32 USART 的 NVIC 中断
  * @param  无
  * @retval 无
  */
/* LPUART user callback */
volatile uint16_t ucTcpClosedFlag;
volatile uint16_t esp32_ready=0;
volatile uint16_t WifiConnectedFlag;
volatile uint16_t WifiDisconnectedFlag;
void LPUART1_Init(uint32_t Baudrate)
{
    lpuart_config_t config;
    TxdBytes=0;
	  CLOCK_SetLpuartClock(2U);

    /*
     * config.baudRate_Bps = 115200U;
     * config.parityMode = kLPUART_ParityDisabled;
     * config.stopBitCount = kLPUART_OneStopBit;
     * config.txFifoWatermark = 0;
     * config.rxFifoWatermark = 0;
     * config.enableTx = false;
     * config.enableRx = false;
     */
    LPUART_GetDefaultConfig(&config);
    config.baudRate_Bps = Baudrate;
    config.enableTx = true;
    config.enableRx = true;

    LPUART_Init(LPUART1, &config, CLOCK_GetFreq(kCLOCK_Osc0ErClk));
    LPUART_EnableInterrupts(LPUART1, kLPUART_RxDataRegFullInterruptEnable);
	  LPUART_EnableInterrupts(LPUART1, kLPUART_IdleLineInterruptEnable);
		LPUART_EnableInterrupts(LPUART1,kLPUART_TransmissionCompleteInterruptEnable);
		LPUART_EnableInterrupts(LPUART1,kLPUART_RxOverrunInterruptEnable);
    //NVIC_SetPriorityGrouping(1);
		NVIC_SetPriority(LPUART1_IRQn,2);
		EnableIRQ(LPUART1_IRQn);
}

void LPUART1_DMA_Init(uint32_t Baudrate){
	lpuart_config_t lpuartConfig;
	TxdBytes=0;
	

  CLOCK_SetLpuartClock(2U);

    /* Initialize the LPUART. */
    /*
     * lpuartConfig.baudRate_Bps = 115200U;
     * lpuartConfig.parityMode = kLPUART_ParityDisabled;
     * lpuartConfig.stopBitCount = kLPUART_OneStopBit;
     * lpuartConfig.txFifoWatermark = 0;
     * lpuartConfig.rxFifoWatermark = 0;
     * lpuartConfig.enableTx = false;
     * lpuartConfig.enableRx = false;
     */
    LPUART_GetDefaultConfig(&lpuartConfig);
    lpuartConfig.baudRate_Bps = Baudrate;
    lpuartConfig.enableTx = true;
    lpuartConfig.enableRx = true;
   #ifdef USE_UARTFLOW	 
    lpuartConfig.enableRxRTS = true;
    lpuartConfig.enableTxCTS = true;
    lpuartConfig.txCtsConfig = kLPUART_CtsSampleAtStart;
    lpuartConfig.txCtsSource = kLPUART_CtsSourcePin;
   #endif
    LPUART_Init(LPUART1, &lpuartConfig, DEMO_LPUART_CLK_FREQ);
		//LPUART1->CTRL &=~LPUART_CTRL_TCIE_MASK;
    LPUART_EnableInterrupts(LPUART1, kLPUART_RxDataRegFullInterruptEnable);
		LPUART_EnableInterrupts(LPUART1, kLPUART_IdleLineInterruptEnable);
		LPUART_EnableInterrupts(LPUART1,kLPUART_RxOverrunInterruptEnable);
		NVIC_SetPriorityGrouping(1);
		NVIC_SetPriority(LPUART1_IRQn,2);
		EnableIRQ(LPUART1_IRQn);
}



void LPUART_UserCallback1(LPUART_Type *base, lpuart_edma_handle_t *handle, status_t status, void *userData)
{
    userData = userData;

   
}


void DMA_MUXChannel_LPUART1_Init(void){
   edma_config_t config;
	  uint8_t g_tipString[2];
	  xfer.data = g_tipString;
    xfer.dataSize = sizeof(g_tipString) - 1;
    DMAMUX_Init(DMAMUX0);
    /* Set channel for LPUART */
    DMAMUX_SetSource(DMAMUX0, LPUART_TX_DMA_CHANNEL, LPUART_TX_DMA_REQUEST);
   
    DMAMUX_EnableChannel(DMAMUX0, LPUART_TX_DMA_CHANNEL);

//    /* Init the EDMA module */
    EDMA_GetDefaultConfig(&config);
    EDMA_Init(LPUART_DMA_BASEADDR, &config);
    EDMA_CreateHandle(&wifi_lpuartTxEdmaHandle, LPUART_DMA_BASEADDR, LPUART_TX_DMA_CHANNEL);
    
    /* Create LPUART DMA handle. */
    LPUART_TransferCreateHandleEDMA(DMA_LPUART, &wifi_lpuartEdmaHandle, LPUART_UserCallback1, NULL, &wifi_lpuartTxEdmaHandle,NULL);
 
    LPUART_SendEDMA(LPUART1, &wifi_lpuartEdmaHandle, &xfer);


 
}

 void DMA1_DMA17_IRQHandler(void)
{  
	 Increase(TailIndex);
   EDMA_ClearChannelStatusFlags(DMA0, LPUART1_DMA_CHANNEL, kEDMA_InterruptFlag);//kEDMA_InterruptFlag
   if(hasByteToTxd())		{
			DMA0->TCD[1].SADDR = (uint32_t)&TXDBUF[TailIndex][0];
      DMA0->TCD[1].CITER_ELINKNO = TXDBUFLength[TailIndex];
      DMA0->TCD[1].BITER_ELINKNO = TXDBUFLength[TailIndex];	
		  DMA0->TCD[1].SLAST =0-TXDBUFLength[TailIndex];//这句本质上可以不要，我反正重置源地址了 
      //**** Destination address reload after major loop finish, no address reload needed
      DMA0->TCD[1].DLAST_SGA = 0x00;	
		  DMA0->SERQ = DMA_SERQ_SERQ(1);
    	 
		}else
	 {
		 Disable485TXD();
	 }
 } 
 
volatile uint32_t ssssss=0;
void LPUART1_IRQHandler()
{  
   uint8_t ucCh;
	uint32_t esp32_readyyyyyyyyyyy=0;
	uint32_t WifiConnectedFlagg=0;
	uint32_t WifiDisconnectedFlagg=0;
	if((LPUART_GetStatusFlags ( LPUART1 ) & LPUART_STAT_TC_MASK)&&(LPUART1->CTRL & LPUART_CTRL_TCIE_MASK)) 	{	  // ??????		
#ifdef USE_LPUART1_TransmissionCompleteInterrupt
	if(hasByteToTxd()){
		LPUART_WriteByte(LPUART1, getTxdByte());
		}else{ 
			Disable485TXD();
		}
#endif
	
#ifdef USE_LPUART1_DMA_TransmissionInterrupt		
#endif
	LPUART_ClearStatusFlags(LPUART1,LPUART_STAT_TC_MASK);
	}else if (( LPUART_GetStatusFlags ( LPUART1 ) & LPUART_STAT_RDRF_MASK )&&(LPUART1->CTRL & LPUART_CTRL_RIE_MASK))
	{
		ucCh  = LPUART_ReadByte( LPUART1 );
		if(Parameter.Esp32TransmissionMode==BrainTransmission){
			strEsp32_Fram_Record .Data_RX_BUF [ strEsp32_Fram_Record .InfBit .FramLength ++ ]  = ucCh;
	  }else if(Parameter.Esp32TransmissionMode==NoBrainTransmission)
		{
			strEsp32_Fram_Record .Data_RX_BUF [ strEsp32_Fram_Record .InfBit .FramLength ++ ]  = ucCh;
			if(isRxdBufFull()) 
				return;
			RxdBuf[RxdBufHeadIndex]=ucCh;
			IncreaseRxdBufNum(RxdBufHeadIndex);
		}
		LPUART_ClearStatusFlags(LPUART1,LPUART_STAT_RDRF_MASK);  //这句是改DMA加的
	}	else if ( ( LPUART_GetStatusFlags ( LPUART1 ) & LPUART_STAT_IDLE_MASK)&&(LPUART1->CTRL & LPUART_CTRL_ILIE_MASK))                                         //数据帧接收完毕
	{ 
		ucCh  = LPUART_ReadByte( LPUART1 ); //可读可不读吧  
		strEsp32_Fram_Record .FramHeadIndex = 0;
		strEsp32_Fram_Record .InfBit .FramFinishFlag = 1;	
	  strEsp32_Fram_Record .InfBit .FramLength  =0;                                                     //由软件序列清除中断标志位(先读USART_SR，然后读USART_DR)
    ucTcpClosedFlag = strstr ( strEsp32_Fram_Record .Data_RX_BUF, "CLOSED\r\n" ) ? 1 : 0; //链接中断
		
		WifiConnectedFlagg= strstr ( strEsp32_Fram_Record .Data_RX_BUF, "connectserver" ) ? 1 : 0; //已经连接上
		WifiDisconnectedFlagg= strstr ( strEsp32_Fram_Record .Data_RX_BUF, "lostserver" ) ? 1 : 0; //已经丢失
		esp32_readyyyyyyyyyyy= strstr ( strEsp32_Fram_Record .Data_RX_BUF, "ready" ) ? 1 : 0; //已经丢失
		if(esp32_readyyyyyyyyyyy)
		{
			esp32_ready=1;
			esp32_readyyyyyyyyyyy=0;
		}else	if(WifiConnectedFlagg)
		{
			WifiConnectedFlag=1;
			WifiConnectedFlagg=0;
		}else if(WifiDisconnectedFlagg)
		{
			WifiDisconnectedFlag=1;
			WifiDisconnectedFlagg=0;
		}
		
		LPUART_ClearStatusFlags(LPUART1,LPUART_STAT_IDLE_MASK);
  }	
	else if ( ( LPUART_GetStatusFlags ( LPUART1 ) & LPUART_STAT_OR_MASK)&&(LPUART1->CTRL & LPUART_CTRL_ORIE_MASK))                                         //数据帧接收完毕
	 LPUART_ClearStatusFlags(LPUART1,LPUART_STAT_OR_MASK);

    
