congcong1991/DAHUA/lwip_client_socket_public_master/ESP32_uart/bsp_esp32_UART.c
}



/**
  * @brief  初始化Esp32用到的 USART
  * @param  无
  * @retval 无
  */

void MK27_USART_Config ( uint32_t Baudrate )
{ 

	#ifdef USE_LPUART1_TransmissionCompleteInterrupt
	LPUART1_Init(Baudrate);
	#endif
	
	#ifdef USE_LPUART1_DMA_TransmissionInterrupt
	
	
	LPUART1_DMA_Init(Baudrate);
	DMA_MUXChannel_LPUART1_Init();
	

	#endif

}



/*
 * 函数名：Esp32_Rst
 * 描述  ：重启WF-Esp32模块
 * 输入  ：无
 * 返回  : 无
 * 调用  ：被 Esp32_AT_Test 调用
 */
//const portTickType xDelay = pdMS_TO_TICKS(500);  
void Esp32_Rst ( void )
{
	#if 0
	 Esp32_Cmd ( "AT+RST", "OK", "ready", 2500 );   	
	
	#else
	 macEsp32_RST_LOW_LEVEL();
	 vTaskDelay (pdMS_TO_TICKS(500)); 
	 macEsp32_RST_HIGH_LEVEL();
	#endif

}


/*
 * 函数名：Esp32_Cmd
 * 描述  ：对WF-Esp32模块发送AT指令
 * 输入  ：cmd，待发送的指令
 *         reply1，reply2，期待的响应，为NULL表不需响应，两者为或逻辑关系
 *         waittime，等待响应的时间
 * 返回  : 1，指令发送成功
 *         0，指令发送失败
 * 调用  ：被外部调用
 */
bool Esp32_Cmd ( char * cmd, char * reply1, char * reply2, uint32_t waittime )
{    
	strEsp32_Fram_Record .InfBit .FramLength = 0;               //从新开始接收新的数据包
  strEsp32_Fram_Record .FramHeadIndex=0;
	macEsp32_Usart ( "%s\r\n", cmd );

	if ( ( reply1 == 0 ) && ( reply2 == 0 ) )                      //不需要接收数据
		return true;
	
	vTaskDelay ( pdMS_TO_TICKS(waittime) );                 //延时
	
	strEsp32_Fram_Record .Data_RX_BUF [ strEsp32_Fram_Record .InfBit .FramLength ]  = '\0';

	//macPC_Usart ( "%s", strEsp32_Fram_Record .Data_RX_BUF );
  Parameter.ch1_int_max=( bool ) strstr ( strEsp32_Fram_Record .Data_RX_BUF, reply1 );
	if ( ( reply1 != 0 ) && ( reply2 != 0 ) )
		
		return ( ( bool ) strstr ( strEsp32_Fram_Record .Data_RX_BUF, reply1 ) || 
						 ( bool ) strstr ( strEsp32_Fram_Record .Data_RX_BUF, reply2 ) ); 
 	
	else if ( reply1 != 0 )
		return ( ( bool ) strstr ( strEsp32_Fram_Record .Data_RX_BUF, reply1 ) );
	
	else
		return ( ( bool ) strstr ( strEsp32_Fram_Record .Data_RX_BUF, reply2 ) );
	
}

bool Esp32_wait_response ( char * reply1, char * reply2, uint32_t waittime )
{    
	strEsp32_Fram_Record .InfBit .FramLength = 0;               //从新开始接收新的数据包
  strEsp32_Fram_Record .FramHeadIndex=0;
	

	if ( ( reply1 == 0 ) && ( reply2 == 0 ) )                      //不需要接收数据
		return true;
	
	vTaskDelay ( pdMS_TO_TICKS(waittime) );                 //延时
	
	strEsp32_Fram_Record .Data_RX_BUF [ strEsp32_Fram_Record .InfBit .FramLength ]  = '\0';

	//macPC_Usart ( "%s", strEsp32_Fram_Record .Data_RX_BUF );
  Parameter.ch1_int_max=( bool ) strstr ( strEsp32_Fram_Record .Data_RX_BUF, reply1 );
	if ( ( reply1 != 0 ) && ( reply2 != 0 ) )
		
		return ( ( bool ) strstr ( strEsp32_Fram_Record .Data_RX_BUF, reply1 ) || 
						 ( bool ) strstr ( strEsp32_Fram_Record .Data_RX_BUF, reply2 ) ); 
 	
	else if ( reply1 != 0 )
		return ( ( bool ) strstr ( strEsp32_Fram_Record .Data_RX_BUF, reply1 ) );
	
	else
		return ( ( bool ) strstr ( strEsp32_Fram_Record .Data_RX_BUF, reply2 ) );
	
}


/*
 * 函数名：Esp32_AT_Test
 * 描述  ：对WF-Esp32模块进行AT测试启动
 * 输入  ：无
 * 返回  : 无
 * 调用  ：被外部调用
 */
//void Esp32_AT_Test ( void )
//{
//	macEsp32_RST_HIGH_LEVEL();
//	
//	vTaskDelay ( 1000 ); 
//	
//	while ( ! Esp32_Cmd ( "AT", "OK", NULL, 500 ) ) Esp32_Rst ();  	

//}
void Esp32_AT_Test ( void )
{
	char count=0;
	
	macEsp32_RST_HIGH_LEVEL();	
	vTaskDelay ( pdMS_TO_TICKS(1000) );
	while ( count < 10 )
	{
		if( Esp32_Cmd ( "AT", "OK", NULL, 500 ) ) return;
		Esp32_Rst();
		++ count;
	}
}
/*
 * 函数名：Esp32_Net_Mode_Choose
 * 描述  ：选择WF-Esp32模块的工作模式
 * 输入  ：enumMode，工作模式
 * 返回  : 1，选择成功
 *         0，选择失败
 * 调用  ：被外部调用
 */
bool Esp32_SETUARTBaudrate ( uint32_t Baudrate )
{
	char cCmd [120];
  #ifdef USE_UARTFLOW
	sprintf ( cCmd, "AT+UART_CUR=%d,8,1,0,3",  Baudrate );  //使能流控
	#else
	sprintf ( cCmd, "AT+UART_CUR=%d,8,1,0,0",  Baudrate );  //使能流控
	#endif
	return Esp32_Cmd ( cCmd, "OK", NULL, 500 );
	
}
/*
 * 函数名：Esp32_Net_Mode_Choose
 * 描述  ：选择WF-Esp32模块的工作模式
 * 输入  ：enumMode，工作模式
 * 返回  : 1，选择成功
 *         0，选择失败
 * 调用  ：被外部调用
 */
bool Esp32_Net_Mode_Choose ( ENUM_Net_ModeTypeDef enumMode )
{
	switch ( enumMode )
	{
		case STA:
			return Esp32_Cmd ( "AT+CWMODE=1", "OK", "no change", 500 ); 
		
	  case AP:
		  return Esp32_Cmd ( "AT+CWMODE=2", "OK", "no change", 2500 ); 
		
		case STA_AP:
		  return Esp32_Cmd ( "AT+CWMODE=3", "OK", "no change", 2500 ); 
		
	  default:
		  return false;
  }
	
}


/*
 * 函数名：Esp32_JoinAP
 * 描述  ：WF-Esp32模块连接外部WiFi
 * 输入  ：pSSID，WiFi名称字符串
 *       ：pPassWord，WiFi密码字符串
 * 返回  : 1，连接成功
 *         0，连接失败
 * 调用  ：被外部调用
 */
bool Esp32_JoinAP ( char * pSSID, char * pPassWord )
{
	char cCmd [120];

	sprintf ( cCmd, "AT+CWJAP=\"%s\",\"%s\"", pSSID, pPassWord );
	
	return Esp32_Cmd ( cCmd, "OK","WIFI CONNECTED", 4500 ); //WIFI CONNECTED
	
} 

bool Esp32_SetIP ( char * IP, char * MASK,char * GATEWAY )
	{
	
	char cCmd [120]="";;

	sprintf ( cCmd, "AT+CIPSTA=\"%s\",\"%s\",\"%s\"",IP,MASK,GATEWAY);
	
  return Esp32_Cmd ( cCmd, "OK", NULL, 500 );
	
}
bool Esp32_SetIP_1(char *localIP,char *LocalMASK,char *LocalGATEWAY,uint8_t dhcp)  //设置IP地址
{
	 uint8_t localIPlength=strlen(localIP);
	 uint8_t LocalMASKlength=strlen(LocalMASK);
	 uint8_t LocalGATEWAYlength=strlen(LocalGATEWAY);
	 CmdBufLength=15+localIPlength+LocalMASKlength+LocalGATEWAYlength;
	 CmdBuf[0]=0X7E;
	 CmdBuf[1]=0xe4;   //T
	 CmdBuf[2]=CmdBufLength-6;
	 CmdBuf[3]=(CmdBufLength-6)>>8;   //L
	 CmdBuf[4]=0X00;   //V_IP
	 CmdBuf[5]=localIPlength;
	{
		for(uint8_t i=0;i<localIPlength;i++)
		CmdBuf[6+i]=localIP[i];
	 
	 }
   CmdBuf[6+localIPlength]=0X01;   //V_MASK
	 CmdBuf[7+localIPlength]=LocalMASKlength;
	{
		for(uint8_t i=0;i<LocalMASKlength;i++)
		CmdBuf[8+localIPlength+i]=LocalMASK[i];
	 
	 }
	 CmdBuf[8+localIPlength+LocalMASKlength]=0X02;   //V_GATEWAY
	 CmdBuf[9+localIPlength+LocalMASKlength]=LocalGATEWAYlength;
	{
		for(uint8_t i=0;i<LocalGATEWAYlength;i++)
		CmdBuf[10+localIPlength+LocalMASKlength+i]=LocalGATEWAY[i];
	 
	 }
	 CmdBuf[10+localIPlength+LocalMASKlength+LocalGATEWAYlength]=0X03;
	 CmdBuf[11+localIPlength+LocalMASKlength+LocalGATEWAYlength]=0X01;
	 CmdBuf[12+localIPlength+LocalMASKlength+LocalGATEWAYlength]=dhcp;
	 CmdBuf[13+localIPlength+LocalMASKlength+LocalGATEWAYlength]=0;
	 for(uint8_t i=1;i<(13+localIPlength+LocalMASKlength+LocalGATEWAYlength);i++)
	 CmdBuf[13+localIPlength+LocalMASKlength+LocalGATEWAYlength]+=CmdBuf[i];//把AP字符串赋值给config
	 CmdBuf[14+localIPlength+LocalMASKlength+LocalGATEWAYlength]=0x7e;
	 CmdBufLength=15+localIPlength+LocalMASKlength+LocalGATEWAYlength;
	 WriteDataToTXDBUF(CmdBuf,CmdBufLength);
	 return Esp32_wait_response( "OK", NULL, 10);
}

bool Esp32_SetAP_1(char *APssid,char *APpassword )  //返回IP地址
{  
	//这边要判断是否工厂设置
	 uint8_t APSSIDlength=strlen(APssid);
	 uint8_t APPASSWORDlength=strlen(APpassword);
	 CmdBufLength=10+APSSIDlength+APPASSWORDlength;
	 CmdBuf[0]=0X7E;
	 CmdBuf[1]=0xe5;   //T
	 CmdBuf[2]=CmdBufLength-6;
	 CmdBuf[3]=(CmdBufLength-6)>>8;   //L
	 CmdBuf[4]=0X00;   //V_IP
	 CmdBuf[5]=APSSIDlength;
	{
		for(uint8_t i=0;i<APSSIDlength;i++)
		CmdBuf[6+i]=APssid[i];
	 
