congcong1991/DAHUA/lwip_client_socket_public_master/ESP32_uart/bsp_esp32_UART.c
	 }
   CmdBuf[6+APSSIDlength]=0X01;   //V_MASK
	 CmdBuf[7+APSSIDlength]=APPASSWORDlength;
	{
		for(uint8_t i=0;i<APPASSWORDlength;i++)
		CmdBuf[8+APSSIDlength+i]=APpassword[i];
	 
	 }
	 CmdBuf[8+APSSIDlength+APPASSWORDlength]=0X00;   //校验和
	 
	 for(uint8_t i=1;i<(8+APSSIDlength+APPASSWORDlength);i++)
	 CmdBuf[8+APSSIDlength+APPASSWORDlength]+=CmdBuf[i];//把AP字符串赋值给config
	 CmdBuf[9+APSSIDlength+APPASSWORDlength]=0x7e;
	 CmdBufLength=10+APSSIDlength+APPASSWORDlength;
	 WriteDataToTXDBUF(CmdBuf,CmdBufLength);
	 return Esp32_wait_response( "OK", NULL, 10);
}

bool Esp32_applynetset()  //返回IP地址
{
	CmdBuf[0]=0x7e;
	CmdBuf[1]=0xff;
	CmdBuf[2]=0x00;
	CmdBuf[3]=0x00;
	CmdBuf[4]=0xff;
	CmdBuf[5]=0x7e;
  CmdBufLength=6;
	WriteDataToTXDBUF(CmdBuf,CmdBufLength);
	return Esp32_wait_response( "connectserver", NULL, 400);
}

bool Esp32_SetTCPSERVER_1(char *TcpServer_IP,char *TcpServer_Port)  //返回IP地址
{
	 uint8_t TcpServer_IPlength=strlen(TcpServer_IP);
	 uint8_t TcpServer_Portlength=strlen(TcpServer_Port);
	 CmdBufLength=10+TcpServer_Portlength+TcpServer_IPlength;
	 CmdBuf[0]=0X7E;
	 CmdBuf[1]=0xe7;   //T
	 CmdBuf[2]=CmdBufLength-6;
	 CmdBuf[3]=(CmdBufLength-6)>>8;   //L
	 CmdBuf[4]=0X00;   //V_IP
	 CmdBuf[5]=TcpServer_IPlength;
	{
		for(uint8_t i=0;i<TcpServer_IPlength;i++)
		CmdBuf[6+i]=TcpServer_IP[i];
	 
	 }
   CmdBuf[6+TcpServer_IPlength]=0X01;   //V_MASK
	 CmdBuf[7+TcpServer_IPlength]=TcpServer_Portlength;
	{
		for(uint8_t i=0;i<TcpServer_Portlength;i++)
		CmdBuf[8+TcpServer_IPlength+i]=TcpServer_Port[i];
	 
	 }
	 CmdBuf[8+TcpServer_IPlength+TcpServer_Portlength]=0X00;   //校验和
	 
	 for(uint8_t i=1;i<(8+TcpServer_IPlength+TcpServer_Portlength);i++)
	 CmdBuf[8+TcpServer_IPlength+TcpServer_Portlength]+=CmdBuf[i];//把AP字符串赋值给config
	 CmdBuf[9+TcpServer_IPlength+TcpServer_Portlength]=0x7e;
	 CmdBufLength=10+TcpServer_IPlength+TcpServer_Portlength;
	 WriteDataToTXDBUF(CmdBuf,CmdBufLength);
	 return Esp32_wait_response( "OK", NULL, 10);
}


/*
 * 函数名：Esp32_AUTOCONNAP
 * 描述  ：上电是否自动连接到AP

 * 返回  : 1，自动连接
 *         0，取消自动连接 保存到flash
 * 调用  ：被外部调用
 */
bool Esp32_AutoConn( FunctionalState enumEnUnvarnishTx )
{
	char cCmd [120];

	sprintf ( cCmd, "AT+CWAUTOCONN=%d",( enumEnUnvarnishTx ? 1 : 0 ) );
	
	return Esp32_Cmd ( cCmd, "OK",NULL, 500 ); //WIFI AUTOCONNECTED
	
}
/*
 * 函数名：Esp32_BuildAP
 * 描述  ：WF-Esp32模块创建WiFi热点
 * 输入  ：pSSID，WiFi名称字符串
 *       ：pPassWord，WiFi密码字符串
 *       ：enunPsdMode，WiFi加密方式代号字符串
 * 返回  : 1，创建成功
 *         0，创建失败
 * 调用  ：被外部调用
 */
bool Esp32_BuildAP ( char * pSSID, char * pPassWord, ENUM_AP_PsdMode_TypeDef enunPsdMode )
{
	char cCmd [120];

	sprintf ( cCmd, "AT+CWSAP=\"%s\",\"%s\",1,%d", pSSID, pPassWord, enunPsdMode );
	
	return Esp32_Cmd ( cCmd, "OK", 0, 1000 );
	
}


/*
 * 函数名：Esp32_Enable_MultipleId
 * 描述  ：WF-Esp32模块启动多连接
 * 输入  ：enumEnUnvarnishTx，配置是否多连接
 * 返回  : 1，配置成功
 *         0，配置失败
 * 调用  ：被外部调用
 */
bool Esp32_Enable_MultipleId ( FunctionalState enumEnUnvarnishTx )
{
	char cStr [20];
	
	sprintf ( cStr, "AT+CIPMUX=%d", ( enumEnUnvarnishTx ? 1 : 0 ) );
	
	return Esp32_Cmd ( cStr, "OK", 0, 500 );
	
}


/*
 * 函数名：Esp32_Enable_MultipleId
 * 描述  ：WF-Esp32模块启动多连接
 * 输入  ：enumEnUnvarnishTx，配置是否多连接
 * 返回  : 1，配置成功
 *         0，配置失败
 * 调用  ：被外部调用
 */
bool Esp32_ReturnSENDCMD (bool disable)
{
	char cStr [20];
	
	sprintf ( cStr, "ATE%d", disable );
	
	return Esp32_Cmd ( cStr, "OK", 0, 500 );
	
}

bool Esp32_setDHCP (FunctionalState disable)
{
	char cStr [20];
	
	sprintf ( cStr, "AT+CWDHCP=%d,1", disable );  //dhcp station
	
	return Esp32_Cmd ( cStr, "OK", 0, 500 );
	
}


/*
 * 函数名：Esp32_Link_Server
 * 描述  ：WF-Esp32模块连接外部服务器
 * 输入  ：enumE，网络协议
 *       ：ip，服务器IP字符串
 *       ：ComNum，服务器端口字符串
 *       ：id，模块连接服务器的ID
 * 返回  : 1，连接成功
 *         0，连接失败
 * 调用  ：被外部调用
 */
bool Esp32_Link_Server ( ENUM_NetPro_TypeDef enumE, char * ip, char * ComNum, ENUM_ID_NO_TypeDef id)
{
	char cStr [100] = { 0 }, cCmd [120];

  switch (  enumE )
  {
		case enumTCP:
		  sprintf ( cStr, "\"%s\",\"%s\",%s", "TCP", ip, ComNum );
		 
		  break;
		//  sprintf ( cCmd, "AT+CWJAP=\"%s\",\"%s\"", pSSID, pPassWord );
		case enumUDP:
		  sprintf ( cStr, "\"%s\",\"%s\",%s", "UDP", ip, ComNum );
		  break;
		
		default:
			break;
  }

  if ( id < 5 )
    sprintf ( cCmd, "AT+CIPSTART=%d,%s", id, cStr);

  else
	  sprintf ( cCmd, "AT+CIPSTART=%s", cStr );  //2s一次心跳包

	return Esp32_Cmd ( cCmd, "OK", "ALREAY CONNECT", 500 );  //500MS问一次 这个等的时间要控制，小路连上之后，会隔一秒就直接询问设备号，他认为1s后就可以进入透传模式
	
}


/*
 * 函数名：Esp32_StartOrShutServer
 * 描述  ：WF-Esp32模块开启或关闭服务器模式
 * 输入  ：enumMode，开启/关闭
 *       ：pPortNum，服务器端口号字符串
 *       ：pTimeOver，服务器超时时间字符串，单位：秒
 * 返回  : 1，操作成功
 *         0，操作失败
 * 调用  ：被外部调用
 */
bool Esp32_StartOrShutServer ( FunctionalState enumMode, char * pPortNum, char * pTimeOver )
{
	char cCmd1 [120], cCmd2 [120];

	if ( enumMode )
	{
		sprintf ( cCmd1, "AT+CIPSERVER=%d,%s", 1, pPortNum );
		
		sprintf ( cCmd2, "AT+CIPSTO=%s", pTimeOver );

		return ( Esp32_Cmd ( cCmd1, "OK", 0, 500 ) &&
						 Esp32_Cmd ( cCmd2, "OK", 0, 500 ) );
	}
	
	else
	{
		sprintf ( cCmd1, "AT+CIPSERVER=%d,%s", 0, pPortNum );

		return Esp32_Cmd ( cCmd1, "OK", 0, 500 );
	}
	
}


/*
 * 函数名：Esp32_Get_LinkStatus
 * 描述  ：获取 WF-Esp32 的连接状态，较适合单端口时使用
 * 输入  ：无
 * 返回  : 2，获得ip
 *         3，建立连接
 *         3，失去连接
 *         0，获取状态失败
 * 调用  ：被外部调用
 */
uint8_t Esp32_Get_LinkStatus ( void )
{
	if ( Esp32_Cmd ( "AT+CIPSTATUS", "OK", 0, 500 ) )
	{
		if ( strstr ( strEsp32_Fram_Record .Data_RX_BUF, "STATUS:2\r\n" ) )
			return 2;
		
		else if ( strstr ( strEsp32_Fram_Record .Data_RX_BUF, "STATUS:3\r\n" ) )
			return 3;
		
		else if ( strstr ( strEsp32_Fram_Record .Data_RX_BUF, "STATUS:4\r\n" ) )
			return 4;		

	}
	
	return 0;
	
}

/*
 * 函数名：Esp32_Get_Sation_IP
 * 描述  ：获取 WF-Esp32 的本地IP
 * 输入  ：无
 * 返回  : 2，获得ip
 *         3，建立连接
 *         3，失去连接
 *         0，获取状态失败
 * 调用  ：被外部调用
 */
uint8_t Esp32_Get_Sation_IP ( void )
{ 
	uint8_t num;
	char *localIP;
	if ( Esp32_Cmd ( "AT+CIFSR", "OK", 0, 500 ) )
	{
		localIP= strstr ( strEsp32_Fram_Record .Data_RX_BUF, "STAIP,\""  );
			
	if ( localIP )
		localIP += 7;
	
	else
		return 0;
	
