congcong1991/DAHUA/lwip_client_socket_public_master/ESP32_uart/bsp_esp32_UART.c
	for ( num = 0; num < 16; num ++ )
	{
		config.LocalIP[ num ] = * ( localIP + num);
		
		if ( config.LocalIP[ num ] == '\"' )
		{
			config.LocalIP[ num ] = '\0';
			break;
		}
		
	}
	}
	return 0;	
}

/*
 * 函数名：Esp32_Get_IdLinkStatus
 * 描述  ：获取 WF-Esp32 的端口（Id）连接状态，较适合多端口时使用
 * 输入  ：无
 * 返回  : 端口（Id）的连接状态，低5位为有效位，分别对应Id5~0，某位若置1表该Id建立了连接，若被清0表该Id未建立连接
 * 调用  ：被外部调用
 */
uint8_t Esp32_Get_IdLinkStatus ( void )
{
	uint8_t ucIdLinkStatus = 0x00;
	
	
	if ( Esp32_Cmd ( "AT+CIPSTATUS", "OK", 0, 500 ) )
	{
		if ( strstr ( strEsp32_Fram_Record .Data_RX_BUF, "+CIPSTATUS:0," ) )
			ucIdLinkStatus |= 0x01;
		else 
			ucIdLinkStatus &= ~ 0x01;
		
		if ( strstr ( strEsp32_Fram_Record .Data_RX_BUF, "+CIPSTATUS:1," ) )
			ucIdLinkStatus |= 0x02;
		else 
			ucIdLinkStatus &= ~ 0x02;
		
		if ( strstr ( strEsp32_Fram_Record .Data_RX_BUF, "+CIPSTATUS:2," ) )
			ucIdLinkStatus |= 0x04;
		else 
			ucIdLinkStatus &= ~ 0x04;
		
		if ( strstr ( strEsp32_Fram_Record .Data_RX_BUF, "+CIPSTATUS:3," ) )
			ucIdLinkStatus |= 0x08;
		else 
			ucIdLinkStatus &= ~ 0x08;
		
		if ( strstr ( strEsp32_Fram_Record .Data_RX_BUF, "+CIPSTATUS:4," ) )
			ucIdLinkStatus |= 0x10;
		else 
			ucIdLinkStatus &= ~ 0x10;	

	}
	
	return ucIdLinkStatus;
	
}


/*
 * 函数名：Esp32_Inquire_ApIp
 * 描述  ：获取 F-Esp32 的 AP IP
 * 输入  ：pApIp，存放 AP IP 的数组的首地址
 *         ucArrayLength，存放 AP IP 的数组的长度
 * 返回  : 0，获取失败
 *         1，获取成功
 * 调用  ：被外部调用
 */
uint8_t Esp32_Inquire_ApIp ( char * pApIp, uint8_t ucArrayLength )
{
	char uc;
	
	char * pCh;
	
	
  Esp32_Cmd ( "AT+CIFSR", "OK", 0, 500 );
	
	pCh = strstr ( strEsp32_Fram_Record .Data_RX_BUF, "APIP,\"" );
	
	if ( pCh )
		pCh += 6;
	
	else
		return 0;
	
	for ( uc = 0; uc < ucArrayLength; uc ++ )
	{
		pApIp [ uc ] = * ( pCh + uc);
		
		if ( pApIp [ uc ] == '\"' )
		{
			pApIp [ uc ] = '\0';
			break;
		}
		
	}
	
	return 1;
	
}

void Set_Esp32_UnvarnishSend (void)
{
	while ( ! Esp32_UnvarnishSend () );
	Parameter.Esp32TransmissionMode=NoBrainTransmission;
}
/*
 * 函数名：Esp32_UnvarnishSend
 * 描述  ：配置WF-Esp32模块进入透传发送
 * 输入  ：无
 * 返回  : 1，配置成功
 *         0，配置失败
 * 调用  ：被外部调用
 */
bool Esp32_UnvarnishSend ( void )
{
	if ( ! Esp32_Cmd ( "AT+CIPMODE=1", "OK", 0, 200 ) )
		return false;
	
	return 
	  Esp32_Cmd ( "AT+CIPSEND", "OK", ">", 200 );
	
}


/*
 * 函数名：Esp32_ExitUnvarnishSend
 * 描述  ：配置WF-Esp32模块退出透传模式
 * 输入  ：无
 * 返回  : 无
 * 调用  ：被外部调用
 */
void Esp32_ExitUnvarnishSend ( void )
{
	vTaskDelay ( pdMS_TO_TICKS(1000) );
	
	macEsp32_Usart ( "+++" );
	
	vTaskDelay ( pdMS_TO_TICKS(500) );
	Parameter.Esp32TransmissionMode=BrainTransmission;
	Esp32_Cmd ( "AT+CIPMODE=0", "OK", 0, 200); //退出透传模式
	Esp32_Cmd ( "AT+CIPCLOSE", "OK", 0, 200); //退出TCP连接
	
}

bool Esp32_DisconnAP ( void ) //断开AP连接
{
	char cStr [20];
	
	sprintf ( cStr, "AT+CWQAP" );
	
	return Esp32_Cmd ( cStr, "OK", 0, 500 );
	
}




/*
 * 函数名：Esp32_SendString
 * 描述  ：WF-Esp32模块发送字符串
 * 输入  ：enumEnUnvarnishTx，声明是否已使能了透传模式
 *       ：pStr，要发送的字符串
 *       ：ulStrLength，要发送的字符串的字节数
 *       ：ucId，哪个ID发送的字符串
 * 返回  : 1，发送成功
 *         0，发送失败
 * 调用  ：被外部调用
 */
bool Esp32_SendString ( FunctionalState enumEnUnvarnishTx, char * pStr, uint32_t ulStrLength, ENUM_ID_NO_TypeDef ucId )
{
	char cStr [20];
	bool bRet = false;
	
		
	if ( enumEnUnvarnishTx )
	{
		macEsp32_Usart ( "%s", pStr );
		
		bRet = true;
		
	}

	else
	{
		if ( ucId < 5 )
			sprintf ( cStr, "AT+CIPSEND=%d,%d", ucId, ulStrLength + 2 );

		else
			sprintf ( cStr, "AT+CIPSEND=%d", ulStrLength + 2 );
		
		Esp32_Cmd ( cStr, "> ", 0, 1000 );

		bRet = Esp32_Cmd ( pStr, "SEND OK", 0, 1000 );
  }
	
	return bRet;

}


/*
 * 函数名：Esp32_ReceiveString
 * 描述  ：WF-Esp32模块接收字符串
 * 输入  ：enumEnUnvarnishTx，声明是否已使能了透传模式
 * 返回  : 接收到的字符串首地址
 * 调用  ：被外部调用
 */
char * Esp32_ReceiveString ( FunctionalState enumEnUnvarnishTx )
{
	char * pRecStr = 0;
	
	
	strEsp32_Fram_Record .InfBit .FramLength = 0;
	strEsp32_Fram_Record .InfBit .FramFinishFlag = 0;
	
	while ( ! strEsp32_Fram_Record .InfBit .FramFinishFlag );
	strEsp32_Fram_Record .Data_RX_BUF [ strEsp32_Fram_Record .InfBit .FramLength ] = '\0';
	
	if ( enumEnUnvarnishTx )
		pRecStr = strEsp32_Fram_Record .Data_RX_BUF;
	
	else 
	{
		if ( strstr ( strEsp32_Fram_Record .Data_RX_BUF, "+IPD" ) )
			pRecStr = strEsp32_Fram_Record .Data_RX_BUF;

	}

	return pRecStr;
	
}
